var _6_ = 0, _7_ = 0, _8_ = 0, _9_ = 0, _10_ = 0;
var vis_1 = "Python. Синтаксис. <br><br> Кез келген тілді үйрену оның синтаксисін үйренуден басталады. <br><br> <b>Python</b> тілінің синтаксисі мынадай құрылымға ие. <br> Латын әрпінің үлкен және кіші әріптері - А, В, С,...,Х, У, Z, a, b, c, ..., x, y, z <br> цифрлар - 0, 1, 2, 3, 4, 5, 6, 7, 8, 9 <br> Арнайы символдар - +, –, *, &, ^, # және т.б. <br> Қызметтік сөздер - for, if, class, def, print, input және т.б. <br><br>";
var vis_2 = "<span> <b>Идентификаторлар</b> (айнымалылар атауы) – әріппен басталатын цифрлар мен әріптер тізбегі. Идентификатор латын әріптерінен, төменгі сызу таңбасы _k1 және 0 мен 9 арасындағы цифрлардан құралады. Мысалы, A, s25, a1b88, tri_plus_dv, zzz. Python-ның әріптер регистрі үлкен және кіші әріптерге ажыратылып берілген. Мысалы, komp1 және KOMP1 – екеуі екі түрлі айнымалыға жатады. Программада қолданылатын айнымалыларды <b>идентификатор</b> деп атайды. </span> <br><br> <b>Айнымалы</b> – мәні мен типі бар шама. Программамен жұмыс барысында айнымалылардың мәнін өзгертіп отыруға болады. <br><br><b>Қызметтік сөздер</b>. Кейбір атауларды программалау барысында айнымалы ретінде қолдануға болмайды. Мұндай сөздер қызметтік сөздер деп аталады. Мысалы: for, if, class, def және т.б. <br><br>";
var vis_3 = "<b>Python тілінің синтаксисі</b> <br> <ul> <li>Программадағы жолдардың соңына нүкте мен үтір қою міндетті емес.</li> <li>Бірнеше команданы бір жолда нүктелі үтір (;) арқылы жазуға болады.</li> <li>Программа жазу барысында басқа программалау тілдеріндегідей begin..end және {..} жақшалар қолданылмайды. Керек болған жағдайда ондай жақшалардың орнына 4 бос орын немесе табуляция қойылады.</li> </ul>";
var vis_4 = "<pre>     Python-да толыққанды программа жасау үшін программа терезесінде File (Файл) – New File <br> командаларын орындап, жаңа программа жазу алаңын дайындап аламыз. Бұл бетке жазылған <br> программа кодын орындау үшін Run – Run Module командаларын басамыз. Төмендегі программа <br> кодына назар аударайық :</pre>";
var vis_photo = "<img src='images/example.png'><img src='images/example2.png'>";
var vis_5 = "Программа кодына түсініктеме берейік: <br> 1. a, b және с айнымалыларының мәні сәйкесінше 4, 12 және 10-ға тең. <br> 2. Үш санның қосындысының мәні а айнымалысына меншіктеледі.<pre>    <b>Меншіктеу</b> – айнымалыға жаңа мән жүктеу. </pre>3. а айнымалысының мәні экранға шығады.<br><br>"
var vis_6 = "<span> <b>Сызықтық алгоритм (программа)</b> дегеніміз – тармақталу, қайталану әрекеттері жоқ, әрекеттердің тізбектей орындалуын сипаттайтын алгоритм </span> <br><br> <table> <thead> <tr><th colspan='2'>Амалдар</th></tr> </thead> <tbody> <tr><td>x + y</td> <td>қосу</td> </tr> <tr> <td>x - y</td> <td>азайту</td> </tr> <tr> <td>x * y</td> <td>көбейту</td> </tr> <tr> <td>x / y</td> <td>бөлу</td> </tr> <tr> <td>x // y</td> <td>бүтін бөлік</td> </tr> <tr> <td>x % y</td> <td>қалдық</td> </tr> </tbody> </table> <pre>    Өрнек амалдардың қай ретпен орындалатынын көрсетеді. Өрнек айнымалы мен тұрақты <br> шамалардан, жақшалар мен амалдардан құралады. Мысалы, (а + b + 5) * с. <br><pre>    <b>іnput()</b> функциясы программаға жолдық деректерді енгізеді. Ал сандық дерек енгізу үшін бұл <br> функция <b>int(input())</b> түрінде жазылады.</pre>";
var vis_photo2 = "1-ші мысал : <br><img src='images/example3.png'><img src='images/example4.png'> <br><br> 2-ші мысал : <br> <img src='images/example5.png'><img src='images/example6.png'> <br> <pre>    1-мысалда a және b айнымалыларының мәндері жол ретінде қарастырылады. Қосу амалы екеуін <br> біріктіріп, экранға шығарады. Ал 2-мысалда программа екі айнымалының мәнін бүтін сан <br> <b>(int, integer – бүтін сан)</b> деп қабылдап, олардың қосындысын шығарады. </pre>";
var vis_7 = "</pre>Деректердің типтері <br><br> <b>Дерек</b> – өңделмеген әртүрлі фактілер, цифрлар. Өңдеудің нәтижесінде белгілі бір мағынаға ие болған дерек ақпаратқа жатады. Төменгі сыныптарда ақпаратты ұсынудың мәтіндік, сандық, дыбыстық және графикалық түрлерімен танысқанбыз. Программалау тілдерінің көмегімен деректерді өңдеу үшін оларды типтерге жіктейді. Сандық ақпарат сандық деректерден құрылады. Математикада сандар осінде орналасқан сандарды натурал, бүтін, нақты және т.б. түрлерге жіктейді. Ал мәтіндік ақпарат – символдық және жолдық деректерден құралады. Деректердің жіктелуі оларды компьютерде өңдеу кезінде маңызды рөл атқарады. <br><br> <span>Тұрақты, айнымалы және өрнектер қабылдай алатын мәндерді, олармен орындауға болатын амалдардың жиынтығын деректер типі деп атайды</span> <br> Python-да қолданылатын деректер бүтін сан, нақты сан, жолдық және логикалық типтердің біріне жатады.";
var vis_8 = "<table> <thead> <tr><th>Типтің атауы</th> <th>Типтің атауы</th> <th>Қабылдайтын мәндері</th></tr> <thead> </table>";

var vis1 = "Тармақталған алгоритмдерді программалау";
var vis2 = "";
var vis3 = "";
var vis4 = "";

function _6class() {    
    if (_6_ % 2 == 0) {
        document.getElementById("txt").innerHTML = vis_1 + vis_2 + vis_3 + vis_4 + vis_photo + vis_5 + vis_6 + vis_photo2 + vis_7 + vis_8;
    } else {
        document.getElementById("txt").innerHTML = "";
    }
    _6_++;
}

function _7class() {
    if (_7_ % 2 == 0) {
        document.getElementById("txt1").innerHTML = vis1;
    } else {
        document.getElementById("txt1").innerHTML = "";
    }
    _7_++;
}

function _8class() {
    if (_8_ % 2 == 0) {
        document.getElementById("txt2").innerHTML = vis2;
    } else {
        document.getElementById("txt2").innerHTML = "";
    }
    _8_++;
}

function _9class() {
    if (_9_ % 2 == 0) {
        document.getElementById("txt3").innerHTML = vis3;
    } else {
        document.getElementById("txt3").innerHTML = "";
    }
    _9_++;
}

function _10class() {
    if (_10_ % 2 == 0) {
        document.getElementById("txt4").innerHTML = vis4;
    } else {
        document.getElementById("txt4").innerHTML = "";
    }
    _10_++;
}